#pragma once

/********************************************************************************
Файл общих настроек проекта.



 Проект:      Neocore                                                         
 Автор:       Макшанов Олег Васильевич                                     
 Дата:        14 марта 2019г                                               
 Версия:      0.1                                                          
 Компания:    ООО "ДиСиСи"                                                 
 mail:        pvp@dcconsult.ru 
 ********************************************************************************/


#define ADC_PERIOD_US           500     // Период дискретизации в мкс.
#define COUNT_OF_DISCRETS       2000    // Количество точек измерений
#define REF_VOLT                2.048   // Значение опорного источника