/********************************************************************************
Таймер.
Таймер используется для тактирования АЦП по событий TRG0



 Проект:      Neocore                                                         
 Автор:       Макшанов Олег Васильевич                                     
 Дата:        8 апреля 2019г                                               
 Версия:      0.1                                                          
 Компания:    ООО "ДиСиСи"                                                 
 mail:        pvp@dcconsult.ru 
 ********************************************************************************/


#include "hal/hal.h"

hal_retcode hal_tim6_init(void);
hal_retcode hal_tim6_start(void);
hal_retcode hal_tim6_stop(void);
hal_retcode hal_tim6_set(uint16_t usec);